/*
 * ......................................&&.........................
 * ....................................&&&..........................
 * .................................&&&&............................
 * ...............................&&&&..............................
 * .............................&&&&&&..............................
 * ...........................&&&&&&....&&&..&&&&&&&&&&&&&&&........
 * ..................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&..............
 * ................&...&&&&&&&&&&&&&&&&&&&&&&&&&&&&.................
 * .......................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&.........
 * ...................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&...............
 * ..................&&&   &&&&&&&&&&&&&&&&&&&&&&&&&&&&&............
 * ...............&&&&&@  &&&&&&&&&&..&&&&&&&&&&&&&&&&&&&...........
 * ..............&&&&&&&&&&&&&&&.&&....&&&&&&&&&&&&&..&&&&&.........
 * ..........&&&&&&&&&&&&&&&&&&...&.....&&&&&&&&&&&&&...&&&&........
 * ........&&&&&&&&&&&&&&&&&&&.........&&&&&&&&&&&&&&&....&&&.......
 * .......&&&&&&&&.....................&&&&&&&&&&&&&&&&.....&&......
 * ........&&&&&.....................&&&&&&&&&&&&&&&&&&.............
 * ..........&...................&&&&&&&&&&&&&&&&&&&&&&&............
 * ................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&............
 * ..................&&&&&&&&&&&&&&&&&&&&&&&&&&&&..&&&&&............
 * ..............&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&....&&&&&............
 * ...........&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&......&&&&............
 * .........&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&.........&&&&............
 * .......&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&...........&&&&............
 * ......&&&&&&&&&&&&&&&&&&&...&&&&&&...............&&&.............
 * .....&&&&&&&&&&&&&&&&............................&&..............
 * ....&&&&&&&&&&&&&&&.................&&...........................
 * ...&&&&&&&&&&&&&&&.....................&&&&......................
 * ...&&&&&&&&&&.&&&........................&&&&&...................
 * ..&&&&&&&&&&&..&&..........................&&&&&&&...............
 * ..&&&&&&&&&&&&...&............&&&.....&&&&...&&&&&&&.............
 * ..&&&&&&&&&&&&&.................&&&.....&&&&&&&&&&&&&&...........
 * ..&&&&&&&&&&&&&&&&..............&&&&&&&&&&&&&&&&&&&&&&&&.........
 * ..&&.&&&&&&&&&&&&&&&&&.........&&&&&&&&&&&&&&&&&&&&&&&&&&&.......
 * ...&&..&&&&&&&&&&&&.........&&&&&&&&&&&&&&&&...&&&&&&&&&&&&......
 * ....&..&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&...........&&&&&&&&.....
 * .......&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&..............&&&&&&&....
 * .......&&&&&.&&&&&&&&&&&&&&&&&&..&&&&&&&&...&..........&&&&&&....
 * ........&&&.....&&&&&&&&&&&&&.....&&&&&&&&&&...........&..&&&&...
 * .......&&&........&&&.&&&&&&&&&.....&&&&&.................&&&&...
 * .......&&&...............&&&&&&&.......&&&&&&&&............&&&...
 * ........&&...................&&&&&&.........................&&&..
 * .........&.....................&&&&........................&&....
 * ...............................&&&.......................&&......
 * ................................&&......................&&.......
 * .................................&&..............................
 * ..................................&..............................
 */


#include "RUI_MATH.h"
#include "stddef.h"
/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	    //int16_t绝对值
 *	@parameter:		    //
 *	@time:				//23-04-20 03:38
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
int16_t RUI_F_MATH_ABS_int16_t(int16_t DATA)
{

    return DATA>>15 == 0 ? DATA : (~DATA + 1);
}
int32_t RUI_F_MATH_ABS_int32_t(int32_t DATA)
{
    if (DATA < 0) return -DATA;
    if (DATA > 0) return DATA;
	return 0;
}

/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	    //float绝对值
 *	@parameter:		    //
 *	@time:				//23-04-20 03:39
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
float RUI_F_MATH_ABS_float(float DATA)
{
    uint32_t RUI_V_TEMP = *(uint32_t*) &DATA;
    RUI_V_TEMP &= 0x7FFFFFFF; // 将符号位清零
    return *(float*) &RUI_V_TEMP;
}

/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	    //float 限幅
 *	@parameter:		    //
 *	@time:				//23-04-20 03:39
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
float RUI_F_MATH_Limit_float(float MAX , float MIN , float DATA)
{
    return (DATA > MAX) ? MAX : ((DATA < MIN) ? MIN : DATA);
}
/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	    //int16 限幅
 *	@parameter:		    //
 *	@time:				//2023-05-23 17:41
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
int16_t RUI_F_MATH_Limit_int16(int16_t MAX , int16_t MIN , int16_t DATA)
{
    return (DATA > MAX) ? MAX : ((DATA < MIN) ? MIN : DATA);
}
/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	    //SETBIT
 *	@parameter:		    //@设置的字节的指针@要设置的位所在的位置（0到7），@要设置的值（1表示要将指定位设置为1，0表示要将其设置为0）
 *	@time:				//23-04-20 02:28
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
void RUI_F_MATH_SETBIT(unsigned char* byte , int position , int value)
{
    unsigned char mask = 1 << position;  // 生成一个只有指定位置为1的掩码
    if (value)
    {
        *byte |= mask;  // 将指定位置设置为1
    }
    else
    {
        *byte &= ~mask;  // 将指定位置设置为0
    }
}
/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	    //float平方根倒数
 *	@parameter:		    //
 *	@time:				//23-04-20 10:20
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
float RUI_F_MATH_INV_SQRT_float(float DATA)
{
    float DATA_half = 0.5f * DATA;
    uint32_t i = *(uint32_t*) &DATA; // 将浮点数视为无符号整数
    i = 0x5f3759df - (i >> 1); // 运用魔数进行处理
    DATA = *(float*) &i; // 再将无符号整数转回浮点数
    DATA = DATA * (1.5f - DATA_half * DATA * DATA); // 进行牛顿迭代
    return DATA;
}

//float uint_to_float(int16_t x_int, float span, int16_t value)
//{
//	return x_int-value/2/value*span;
//}
float Hex_To_Float(uint32_t *Byte,int num)//十六进制到浮点数
{
  return *((float*)Byte);
}

uint32_t FloatTohex(float HEX)//浮点数到十六进制转换
{
  return *( uint32_t *)&HEX;
}

/**
************************************************************************
* @brief:      	float_to_uint: 浮点数转换为无符号整数函数
* @param[in]:   x_float:	待转换的浮点数
* @param[in]:   x_min:		范围最小值
* @param[in]:   x_max:		范围最大值
* @param[in]:   bits: 		目标无符号整数的位数
* @retval:     	无符号整数结果
* @details:    	将给定的浮点数 x 在指定范围 [x_min, x_max] 内进行线性映射，映射结果为一个指定位数的无符号整数
************************************************************************
**/
int float_to_uint(float x_float, float x_min, float x_max, int bits)
{
  /* Converts a float to an unsigned int, given range and number of bits */
  float span = x_max - x_min;
  float offset = x_min;
  return (int) ((x_float-offset)*((float)((1<<bits)-1))/span);
}
/**
************************************************************************
* @brief:      	uint_to_float: 无符号整数转换为浮点数函数
* @param[in]:   x_int: 待转换的无符号整数
* @param[in]:   x_min: 范围最小值
* @param[in]:   x_max: 范围最大值
* @param[in]:   bits:  无符号整数的位数
* @retval:     	浮点数结果
* @details:    	将给定的无符号整数 x_int 在指定范围 [x_min, x_max] 内进行线性映射，映射结果为一个浮点数
************************************************************************
**/
float uint_to_float(int x_int, float x_min, float x_max, int bits)
{
  /* converts unsigned int to float, given range and number of bits */
  float span = x_max - x_min;
  float offset = x_min;
  return ((float)x_int)*span/((float)((1<<bits)-1)) + offset;
}

float get_vbus_input(uint16_t value)
{
	return ((float)value*3.3f/65535)*11.0f;
}

float SBUSdata[10];
float averageFilter(float in_data)
{
	float sum = 0;
	for(int i=0; i<9; i++)
	{
		SBUSdata[i]=SBUSdata[i+1];
		sum = sum + SBUSdata[i];
	}
	SBUSdata[9] = in_data;
	sum = sum + SBUSdata[9];

	return(sum/10);
}
/**
 * 对给定的数据进行周期性间隔调整。
 *
 * 此函数将输入数据按照指定的最大值和最小值进行周期性调整，确保数据值位于[min, max]区间内。
 * 如果输入数据大于max，则将其减去max；如果小于min，则将其加上max。
 * 这样做可以实现数据的周期性循环。
 *
 * @param max 定义调整范围的最大值。
 * @param min 定义调整范围的最小值。
 * @param data 指向需要调整的数据的指针。
 * @return 返回调整后的数据值。
 *
 * @author ZHangHan
 */
float IntervalCyclic(float max, float min, float* data)
{
  // 检查传入的数据指针是否为NULL
  if (data == NULL)
  {
    return 0;
  }

  // 交换max和min的值，确保max始终大于min
  float temp;
  if (max < min) {
    temp = max;
    max = min;
    min = temp;
  }

  // 获取待调整的数据值
  float value = *data;

  // 如果数据值大于等于max，则减去max；如果小于等于min，则加上max，实现周期性调整
  if (value >= max) {
    value = value - (max-min);
  }
  else if (value <= min) {
    value = value + (max-min);
  }

  // 更新原始数据值
  *data = value;
  // 返回调整后的数据值
  return value;
}

float shortest_path(float Current,float Target)
{	if(Target-Current>180.0f)
		Target=Target-360;
	else if(Target-Current<-180.0f)
		Target=Target+360;
	return Target;
}

float low(float*a,float b,float n)
{
	*a=n*b+(1-n)*(*a);
	return *a;
}

float limit(float max, float min, float* data)
{
  // 检查传入的数据指针是否为NULL
  if (data == NULL)
  {
    return 0;
  }

  // 交换max和min的值，确保max始终大于min
  float temp;
  if (max < min) {
    temp = max;
    max = min;
    min = temp;
  }

  // 获取待调整的数据值
  float value = *data;

  // 如果数据值大于等于max，则减去max；如果小于等于min，则加上max，实现周期性调整
  if (value >= max) {
    value =max;
  }
  else if (value <= min) {
    value = min;
  }

  // 更新原始数据值
  *data = value;
  // 返回调整后的数据值
  return value;
}
float IntervalLimit(float max, float min, float data)
{
  if (max >= min)
  {
    if (data >= max)return max;
    else if (data <= min)return min;
    else return data;
  }
  else
  {
    float temp;
    temp = min;
    min = max;
    max = temp;

    if (data >= max)return max;
    else if (data <= min)return min;
    else return data;
  }
}